In [3]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import os

In [4]:
os.getcwd()

'C:\\Users\\SUDHARSHAN'

In [5]:
os.chdir("F:\TopMentor_DataScience")
os.getcwd()

'F:\\TopMentor_DataScience'

In [8]:
unames=['user_id','gender','age','occu','zip']
rnames=['user_id','movie_id','rating','timestamp']
mnames=['movie_id','title','generes']

In [16]:
users=pd.read_table('users.dat',sep='::',header=None,names=unames)
ratings=pd.read_table('ratings.dat',sep='::',header=None,names=rnames)

C:\Users\SUDHARSHAN\AppData\Local\Temp\ipykernel_3816\1872343259.py:1: ParserWarning: Falling back to the 'python' engine because the 'c' engine does not support regex separators (separators > 1 char and different from '\s+' are interpreted as regex); you can avoid this warning by specifying engine='python'.
  users=pd.read_table('users.dat',sep='::',header=None,names=unames)
C:\Users\SUDHARSHAN\AppData\Local\Temp\ipykernel_3816\1872343259.py:2: ParserWarning: Falling back to the 'python' engine because the 'c' engine does not support regex separators (separators > 1 char and different from '\s+' are interpreted as regex); you can avoid this warning by specifying engine='python'.
  ratings=pd.read_table('ratings.dat',sep='::',header=None,names=rnames)

In [17]:
users[:5]

   user_id gender  age  occu    zip
0        1      F    1    10  48067
1        2      M   56    16  70072
2        3      M   25    15  55117
3        4      M   45     7  02460
4        5      M   25    20  55455

In [18]:
ratings[:5]

   user_id  movie_id  rating  timestamp
0        1      1193       5  978300760
1        1       661       3  978302109
2        1       914       3  978301968
3        1      3408       4  978300275
4        1      2355       5  978824291

In [22]:
data=pd.merge(ratings,users)
data[1:2]

   user_id  movie_id  rating  timestamp gender  age  occu    zip
1        1       661       3  978302109      F    1    10  48067

In [37]:
mean_ratings=data.pivot_table(ratings,rows='title',columns='gender',aggfunc='mean')
mean_ratings

TypeError: DataFrame.pivot_table() got an unexpected keyword argument 'rows'